Revit 2027 API
ScheduleField.SetCombinedParameters Method
 Sets this field's combine parameter array if applicable
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCombinedParameters(
	IList<TableCellCombinedParameterData> data
)
Public Sub SetCombinedParameters (
	data As IList(Of TableCellCombinedParameterData)
)
public:
void SetCombinedParameters(
	IList<TableCellCombinedParameterData^>^ data
)
member SetCombinedParameters :
        data : IList<TableCellCombinedParameterData> -> unit
Parameters
data IList<TableCellCombinedParameterData>
 data is array of TableCellCombinedParameterData to be set as combined parameters
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace